<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Imports the latest SAP Privileges installer package into Munki.</string>

  <key>Identifier</key>
  <string>com.github.thomas-luebker.munki.sapprivileges</string>

  <key>ParentRecipe</key>
  <string>com.github.thomas-luebker.download.sapprivileges</string>

  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>SAPPrivileges</string>
    <key>DISPLAYNAME</key>
    <string>Privileges</string>
    <key>MUNKI_CATEGORY</key>
    <string>Utilities</string>
    <key>MUNKI_DEVELOPER</key>
    <string>SAP</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>apps/Privileges</string>
    <key>DESCRIPTION</key>
    <string>Temporary admin rights management for macOS.</string>

    <key>pkginfo</key>
    <dict>
      <key>name</key>
      <string>%NAME%</string>
      <key>display_name</key>
      <string>%DISPLAYNAME%</string>
      <key>description</key>
      <string>%DESCRIPTION%</string>
      <key>category</key>
      <string>%MUNKI_CATEGORY%</string>
      <key>developer</key>
      <string>%MUNKI_DEVELOPER%</string>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>

  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>version</key>
          <string>%version%</string>
        </dict>
      </dict>
    </dict>

    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_path</key>
        <string>%pathname%</string>
        <key>repo_subdirectory</key>
        <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>