Description: "Downloads the latest SAP Privileges installer package from GitHub Releases."
Identifier: "com.github.thomas-luebker.download.sapprivileges"

Input:
  NAME: "SAPPrivileges"
  GITHUB_REPO: "SAP/macOS-enterprise-privileges"
  ASSET_REGEX: "^Privileges_.*\\.pkg$"

Process:
  - Processor: "GitHubReleasesInfoProvider"
    Arguments:
      github_repo: "%GITHUB_REPO%"
      asset_regex: "%ASSET_REGEX%"

  - Processor: "URLDownloader"
    Arguments:
      url: "%url%"
      filename: "Privileges_%version%.pkg"