Description: "Imports the latest SAP Privileges installer package into Munki."
Identifier: "com.github.thomas-luebker.munki.sapprivileges"
ParentRecipe: "com.github.thomas-luebker.download.sapprivileges"

Input:
  NAME: "SAPPrivileges"
  DISPLAYNAME: "Privileges"
  MUNKI_CATEGORY: "Utilities"
  MUNKI_DEVELOPER: "SAP"
  MUNKI_REPO_SUBDIR: "apps/Privileges"
  DESCRIPTION: "Temporary admin rights management for macOS."

  pkginfo:
    name: "%NAME%"
    display_name: "%DISPLAYNAME%"
    description: "%DESCRIPTION%"
    category: "%MUNKI_CATEGORY%"
    developer: "%MUNKI_DEVELOPER%"
    catalogs:
      - "testing"
    unattended_install: true

Process:
  - Processor: "MunkiImporter"
    Arguments:
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"